# Узнайте у пользователя число n. Найдите сумму чисел n + nn + nnn.
# Например, пользователь ввёл число 3. Считаем 3 + 33 + 333 = 369.

print('Привет! Найдем сумму чисел n + nn + nnn.')
while True:
    print('Для выхода введите: exit или выход')
    user_n = input('Введите число n\n-> : ')

    # ПРОВЕРКИ
    if (user_n == 'exit') or (user_n == 'выход'): # выход из цикла
        break
    if user_n.isnumeric() == False:  # проверка ввода (если ввели не число, а что-то еще
        print('Вы ввели текст, вместо числа.')
        print('Попробуйте еще!\n')
        continue

    # КАЛЬКУЛЯТОР
    n_one = user_n
    n_two = user_n * 2
    n_three = user_n * 3
    n_calc = int(n_one) + int(n_two) + int(n_three)
    print('\n---------------------------------------------------------------------------------------------------------')
    print(f'{n_one} + {n_two} + {n_three} = {n_calc}')
    print('---------------------------------------------------------------------------------------------------------\n')
    repeat = input('Хотите еще что-нибудь просуммировать? (да / нет)\n-> : ')
    if repeat.lower() == 'нет' or repeat.lower() == 'no':
        print(repeat)
        break
    else:
        print('\n-----------------------------------------------------------------------------------------------------')
